import { IUser } from "../models";

export const userData: IUser = {
	"success": true,
	"name": "Литвинов Даниил",
	"info": {
		"speciality": "Информационные системы и программирование",
		"form": "Очная форма обучения",
		"group": "ИСП-8-20 ",
		"curator": " Кондакова Ирина Владимировна"
	},
	"grades": [
		{
			"Дисциплина": "Психология общения",
			"Оценки": "5  5",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Физическая культура / Адаптивная физическая культура",
			"Оценки": "",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Иностранный язык (ОГиСЭЦ)",
			"Оценки": "",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Дискретная математика",
			"Оценки": "5 2 2 4 3 5 5 4  4",
			"Пропуск (занятий)": "22022.02.04"
		},
		{
			"Дисциплина": "Элементы высшей математики",
			"Оценки": "",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Архитектура аппаратных средств",
			"Оценки": "3 4 5 4 4 3 н/а 4 5 5  4",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Информационные технологии",
			"Оценки": "5 5 5 4 4 4 4  4",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Основы алгоритмизации и программирования",
			"Оценки": "",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Основы проектирования баз данных",
			"Оценки": "3 3 4 5 5 5 2 4  4",
			"Пропуск (занятий)": "22022.05.16"
		},
		{
			"Дисциплина": "Операционные системы",
			"Оценки": "",
			"Пропуск (занятий)": "0"
		},
		{
			"Дисциплина": "Проектирование и разработка интерфейсов пользователя",
			"Оценки": "! 5 5 5 5 5 5 5 4 4 5 5 4 4 2 3  5",
			"Пропуск (занятий)": "42022.03.15 2022.05.03"
		},
		{
			"Дисциплина": "Графический дизайн и мультимедиа",
			"Оценки": "5 4 4 4 4 4 5 5 4 4 4 5 5 5 5 5 5 5 4 5 5  5",
			"Пропуск (занятий)": "62022.03.03 2022.05.19"
		},
		{
			"Дисциплина": "Учебная практика 8",
			"Оценки": "5 5 5 4 ! !  5",
			"Пропуск (занятий)": "0"
		}
	],
	"timetable": [
		{
			"number": "2",
			"time": "9.50 11.30",
			"groups": [
				{
					"name": "Психология",
					"teacher": "Антонова",
					"classroom": "319",
					"status": "добавлено"
				}
			]
		},
		{
			"number": "3",
			"time": "12.00 13.40",
			"groups": [
				{
					"name": "МДК.08.02",
					"teacher": "Жукова",
					"classroom": "30",
					"status": "отменено"
				},
				{
					"name": "МДК.08.02",
					"teacher": "Некрасова",
					"classroom": "306",
					"status": "отменено"
				}
			]
		}
	]
}